FirmwareArmy/samd21/src/core/Core.cpp
#include <core/Core.h>

#if defined(__SAMD21E15BU__) || defined(__ATSAMD21E15BU__)
#    include <core/atsamd21e15bu++.cpp>
#elif defined(__SAMD21G17A__) || defined(__ATSAMD21G17A__)
#    include <core/atsamd21g17a++.cpp>
#elif defined(__SAMD21G15A__) || defined(__ATSAMD21G15A__)
#    include <core/atsamd21g15a++.cpp>
#elif defined(__SAMD21G15B__) || defined(__ATSAMD21G15B__)
#    include <core/atsamd21g15b++.cpp>
#elif defined(__SAMD21E16L__) || defined(__ATSAMD21E16L__)
#    include <core/atsamd21e16l++.cpp>
#elif defined(__SAMD21G15L__) || defined(__ATSAMD21G15L__)
#    include <core/atsamd21g15l++.cpp>
#elif defined(__SAMD21E16B__) || defined(__ATSAMD21E16B__)
#    include <core/atsamd21e16b++.cpp>
#elif defined(__SAMD21E16A__) || defined(__ATSAMD21E16A__)
#    include <core/atsamd21e16a++.cpp>
#elif defined(__SAMD21G17L__) || defined(__ATSAMD21G17L__)
#    include <core/atsamd21g17l++.cpp>
#elif defined(__SAMD21E16BU__) || defined(__ATSAMD21E16BU__)
#    include <core/atsamd21e16bu++.cpp>
#elif defined(__SAMD21E17DU__) || defined(__ATSAMD21E17DU__)
#    include <core/atsamd21e17du++.cpp>
#elif defined(__SAMD21E17L__) || defined(__ATSAMD21E17L__)
#    include <core/atsamd21e17l++.cpp>
#elif defined(__SAMD21G17D__) || defined(__ATSAMD21G17D__)
#    include <core/atsamd21g17d++.cpp>
#elif defined(__SAMD21J15A__) || defined(__ATSAMD21J15A__)
#    include <core/atsamd21j15a++.cpp>
#elif defined(__SAMD21G18A__) || defined(__ATSAMD21G18A__)
#    include <core/atsamd21g18a++.cpp>
#elif defined(__SAMD21G17AU__) || defined(__ATSAMD21G17AU__)
#    include <core/atsamd21g17au++.cpp>
#elif defined(__SAMD21J17D__) || defined(__ATSAMD21J17D__)
#    include <core/atsamd21j17d++.cpp>
#elif defined(__SAMD21J17A__) || defined(__ATSAMD21J17A__)
#    include <core/atsamd21j17a++.cpp>
#elif defined(__SAMD21E15CU__) || defined(__ATSAMD21E15CU__)
#    include <core/atsamd21e15cu++.cpp>
#elif defined(__SAMD21E15B__) || defined(__ATSAMD21E15B__)
#    include <core/atsamd21e15b++.cpp>
#elif defined(__SAMD21E15A__) || defined(__ATSAMD21E15A__)
#    include <core/atsamd21e15a++.cpp>
#elif defined(__SAMD21E17A__) || defined(__ATSAMD21E17A__)
#    include <core/atsamd21e17a++.cpp>
#elif defined(__SAMD21E15L__) || defined(__ATSAMD21E15L__)
#    include <core/atsamd21e15l++.cpp>
#elif defined(__SAMD21E17D__) || defined(__ATSAMD21E17D__)
#    include <core/atsamd21e17d++.cpp>
#elif defined(__SAMD21J15B__) || defined(__ATSAMD21J15B__)
#    include <core/atsamd21j15b++.cpp>
#elif defined(__SAMD21G16L__) || defined(__ATSAMD21G16L__)
#    include <core/atsamd21g16l++.cpp>
#elif defined(__SAMD21E16CU__) || defined(__ATSAMD21E16CU__)
#    include <core/atsamd21e16cu++.cpp>
#elif defined(__SAMD21G16A__) || defined(__ATSAMD21G16A__)
#    include <core/atsamd21g16a++.cpp>
#elif defined(__SAMD21G16B__) || defined(__ATSAMD21G16B__)
#    include <core/atsamd21g16b++.cpp>
#elif defined(__SAMD21J16B__) || defined(__ATSAMD21J16B__)
#    include <core/atsamd21j16b++.cpp>
#elif defined(__SAMD21G18AU__) || defined(__ATSAMD21G18AU__)
#    include <core/atsamd21g18au++.cpp>
#elif defined(__SAMD21J16A__) || defined(__ATSAMD21J16A__)
#    include <core/atsamd21j16a++.cpp>
#elif defined(__SAMD21E18A__) || defined(__ATSAMD21E18A__)
#    include <core/atsamd21e18a++.cpp>
#elif defined(__SAMD21J18A__) || defined(__ATSAMD21J18A__)
#    include <core/atsamd21j18a++.cpp>
#endif
